/*Задание 1. Время в пути
Что нужно сделать
Поезд отправляется в AA часов BB минут и прибывает в пункт назначения в CC часов DD минут. Сколько часов и минут он находится в пути?

Напишите программу, которая принимает от пользователя две строки — время отправления и время прибытия поезда. Время задаётся строкой из пяти символов в формате HH:MM.
Обеспечьте контроль ввода, проверьте также, что время корректно.

Программа должна ответить, сколько часов и минут поезд находится в пути. Если время отправления больше времени прибытия, считайте, что поезд прибывает в пункт назначения на следующий день.

Пример выполнения

            Введите время отправления (HH:MM): 09:20
            Введите время прибытия (HH:MM): 10:20
            Поездка составила 1 ч. 0 мин.
            Введите время отправления (HH:MM): 09:20
            Введите время прибытия (HH:MM): 08:40
            Поездка составила 23 ч. 20 мин.

Что оценивается
Программа корректно считает и время внутри одного дня, и время поездки с прибытием на следующий день.
Обеспечен контроль ввода и по длине строк, и по вводимым символам.*/